<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Ludus Design">
   <META NAME="Description" CONTENT="Quadra help">
   <META NAME="Keywords" CONTENT="Ludus Design Quadra Puzzle Game Multiplayer">
   <TITLE>Quadra help - Ludus Design</TITLE>
</HEAD>
<BODY TEXT="#000000" background="hfond.gif" bgproperties="fixed" BGCOLOR="#E9E5F0" LINK="#6B0194" VLINK="#530053" ALINK="#FF0000">

<TABLE BORDER=0 CELLSPACING=0 CELLPADDING=0 >
<TR>
<TD VALIGN=TOP>
<CENTER>
<img src="htext.gif" border=0>
<H1>
Welcome to the Quadra help file
</H1>
<em>
The essential guide to a good understanding of the game, by <font size=-1><a href="mailto:remz@ludusdesign.com"><IMG SRC="th1s.gif" BORDER=0>Remz</a></font> and <font size=-1><a href="mailto:dada@ludusdesign.com"><IMG SRC="th2s.gif" BORDER=0>Dada</a></font>
</em>
</CENTER>
<p>
This guide is for you if you ask yourself the following questions:<BR>
<I>
How do I unpause the game?<BR>
Why is my name "#1"?<BR>
What is a frag?<BR>
</I>
On the other hand, if those questions never troubled you (or at least
no more than 3 minutes) you should instead take a look at the
Strategy guides because, as the wise once said:
<CITE>"Incomplete is your training."</CITE>.<BR>
So without further ado, we will begin explaining.
In any pictures below, you can click on the various options to jump
straight to the relevent description.
<p>
<A Name="menu_principal" href="#menu_principal">
<center><h2>The main menu</h2></center>
</A>
Here's a screenshot of Quadra's main menu:
<p><CENTER>
<MAP name="map_principal">
<area shape="rect" coords="236,99,430,128" href="#solo" alt="Single-player game">
<area shape="rect" coords="159,140,505,170" href="#multi" alt="Multi-player game">
<area shape="rect" coords="184,181,480,212" href="#Demos" alt="Demo central">
<area shape="rect" coords="247,223,418,255" href="#Pointages" alt="Highscores">
<area shape="rect" coords="172,264,491,298" href="#Configurer" alt="Player setup">
<area shape="rect" coords="270,307,392,339" href="#Option" alt="Options">
<area shape="rect" coords="229,347,430,382" href="#Enregistrer" alt="Register">
<area shape="rect" coords="265,391,398,426" href="#quitter" alt="Quit">
<area shape="rect" coords="2,405,209,468" href="#web" alt="Ludus Design web site">
<area shape="rect" coords="458,427,618,448" href="#version" alt="Version information">
</MAP>
<IMG SRC="menuprin_eng.jpg" BORDER=0 usemap="#map_principal" HEIGHT=480 WIDTH=640>
</CENTER>
<UL>
<LI><A NAME="solo" HREF="#menu_solo"><IMG SRC="go_eng.gif" border=0><B> Single-player game</B></A>:
Start a single-player game where the object is to score as much points as possible.
A player scoring high enough can then have his performance recorded
in the Worldwide Highscores list <I>(Note: you need Internet access
to enable this feature)</I>

<LI><A NAME="multi" HREF="#menu_multi"><IMG SRC="go_eng.gif" border=0>
<B> Multi-player game</B></A>: Access the multi-player games menu.
You will then be able to play a game either on a single computer,
a Local Area Network (<i>LAN</i>) or on the Internet.

<LI><A NAME="Demos" HREF="#menu_demo"><IMG SRC="go_eng.gif" border=0>
<B> Demo central</B></A>:
The demo central is used to play back games that were previously
recorded (called "demos"). You will also be able to play back games
downloaded from the Internet.

<LI><A NAME="Pointages" HREF="#menu_pointage"><IMG SRC="go_eng.gif" border=0>
<B> Highscores</B></A>: Display the Worldwide and local highscores list.

<LI><A NAME="Configurer" HREF="#menu_Configurer"><IMG SRC="go_eng.gif" border=0>
<B> Player setup</B></A>: Access the players' configuration screen.

<LI><A NAME="Option" HREF="#menu_option"><IMG SRC="go_eng.gif" border=0>
<B> Options</B></A>: Modify various options according to your
preferences.

<LI><A NAME="Enregistrer" href="#enregistrer">
<B> Register</B></A>: Allows you to register your copy of Quadra.
If you already have done so, choosing this menu option will give you
some informations about Ludus Design and links to our web site
and technical support.

<LI><A NAME="Quitter" href="#Quitter">
<B> Quit</B></A>: When you absolutely have to...

<LI><A NAME="version" href="#version">
<B> Version information</B></A>: Informs you of the version of Quadra
currently running.

<LI><A NAME="web" href="#web">
<B> Ludus Design web site</B></A>: <IMG SRC="doze.gif">
<EM>Windows version only:</EM>
Clicking there will start your default browser and go to Ludus Design's
internet site.
</UL>

You can select menu options by clicking with the mouse.
The following keyboard keys are also supported:<BR>
<IMG SRC="keyb.gif"> TAB for next item, SHIFT + TAB for previous
item, Space or Enter to select an option.
You can also use the arrow keys to move from option to option.
The Escape key is used to go back to the previous menu, cancel a
selection or quit.
<BR>
<IMG SRC="doze.gif"><EM>Windows users:</EM>
You can use the keyboard combo ALT + TAB or CONTROL + ESC to
switch to another windows application while Quadra is running.
Beware, though, that a multi-player game will not be paused while
you're fooling around with other applications :).
<BR>

Ok, now stop gawking at this menu doing nothing! You should go
setup your preferences in the Options menu.
There, you'll be able to select mouse speed, CD music playing mode
and some other stuff.

<A NAME="menu_option" href="#menu_option"><center><h2>The options menu</h2></center></A>
<p><CENTER>
<MAP name="map_option">
<area shape="rect" coords="380,99,453,119" href="#Langue" alt="Language">
<area shape="rect" coords="381,129,553,151" href="#Musique DC" alt="CD music">
<area shape="rect" coords="383,161,437,178" href="#Vitesse du curseur" alt="Mouse speed">
<area shape="rect" coords="381,250,440,271" href="#Port TCP/IP" alt="TCP/IP port">
<area shape="rect" coords="380,311,620,331" href="#Adresse du serveur" alt="Master server address">
<area shape="rect" coords="558,448,641,471" href="#Retour au menu" alt="Back to main menu">
 </MAP>
<IMG SRC="option.jpg" BORDER=0 usemap="#map_option" HEIGHT=480 WIDTH=640>
</CENTER>
<UL>
<LI><A NAME="Langue" href="#Langue"><B> Language</B></A>: You can choose between <B>English</B> and <B>French</B>.
<LI><A NAME="Musique DC" href="#Musique DC"><B> CD Music</B></A>: This allows you to select Quadra's cd player mode.
These are the possible choices:
<UL>
  <LI> <B>No music</B>: Listen to absolute silence.
  <LI> <B>Auto-change track</B>: Change CD track for each play level.
	This can slightly slow down level changes. In multi-player games,
	the track will change when you select a different graphics scheme.
  <LI> <B>Loop all tracks</B>: The CD will be played entirely, from the
	first track to the last.
</UL>

<LI><A NAME="Vitesse du curseur" href="#Vitesse du curseur"><B> Mouse speed</B></A>:
Specify a number between <B>1</B> (utterly slow) and <B>255</B> (fast) for the
mouse's movement speed. The default setting of <B>100</B> is a typical speed.
<LI><A NAME="Port TCP/IP" href="#Port TCP/IP"><B> TCP/IP port</B></A>: <IMG SRC="reso.gif"> <EM>Advanced users:</EM>
This option changes the default TCP port for
multi-player LAN or internet games. Note that if you
change this number, it will probably be impossible
to watch other players (or have them watch you) place
blocks in real-time: the blocks will instead appear
instantly at the bottom of the screen. In most cases,
the default value of <B>3456</B> is perfectly ok.
<LI><A
NAME="Adresse du serveur" href="#Adresse du serveur"><B> Master server address</B></A>:
<IMG SRC="reso.gif"> <EM>Advanced users:</EM>
Specify the master game server URL on the internet.
As of this writing, there is only one public master
server. It's situated on Ludus Design's website at
<B>http://ludusdesign.com/cgibin/qserv.pl</B> (this
is also the default value for this option). Note that
this is not a Quadra server where you would connect
and play the game: rather it's simply a listing of
public multi-player games actually going on. It is not
required to use this list to play multi-player games,
it's only a tool to help players that don't know each
other's IP address get together.
<LI><A NAME="Retour au menu" HREF="#menu_principal"><IMG SRC="go_eng.gif" border=0>
<B> Back to main menu</B></A>: Go back to the main
menu. Keyboard equivalent: <IMG SRC="keyb.gif"> ESC.
</UL>

Vous voici donc dans le menu des options. La
premi&egrave;re chose &agrave; faire, c'est de choisir
la langue d&eacute;sir&eacute;e. Le changement
s'effectuera imm&eacute;diatement apr&egrave;s avoir
cliqu&eacute; sur le bouton "<B>Retour</B>" ou
"<B>Back</B>" dans le bas de l'&eacute;cran. Ensuite,
vous devriez &eacute;galement ajuster &agrave; votre
go&ucirc;t la vitesse de d&eacute;placement de la
souris. Cliquez sur la bo&icirc;te d'entr&eacute;e
situ&eacute;e &agrave; droite de "<B>Vitesse du
curseur de la souris (1-255)</B>", puis tapez-y le
nombre voulu, suivi de <IMG SRC="keyb.gif"> RETOUR.
Une fois cela termin&eacute; et que la vitesse est
acceptable, vous pouvez retourner au menu principal.
Nous allons laisser les deux autres options
tranquilles pour l'instant.<BR> L'&eacute;tape
suivante est de configur&eacute; les informations du
joueur. Allons rendez-vous dans ce menu.

<A NAME="menu_Configurer" href="#menu_Configurer"><center><h2>Configurer les joueurs</h2></center></A>
<p><CENTER>
<MAP name="map_configurer">
  <area shape="rect" coords="30,1,331,64" href="#config_joueur" alt="Configurer joueur">
  <area shape="rect" coords="30,66,296,146" href="#config_nom" alt="Nom">
  <area shape="rect" coords="20,156,267,218" href="#config_Couleur" alt="Couleur">
  <area shape="rect" coords="22,226,259,303" href="#config_Ombre" alt="Ombre">
  <area shape="rect" coords="25,323,258,388" href="#config_Lisse" alt="Lisse">
  <area shape="rect" coords="18,407,364,458" href="#config_Vitesse clavier" alt="Vitesse clavier">
  <area shape="rect" coords="373,49,546,73" href="#config_Changes toutes" alt="Changes toutes">
  <area shape="rect" coords="302,90,635,380" href="#config_Change touche" alt="Change touche">
  <area shape="rect" coords="427,425,560,458" href="#config_retour" alt="Retour">
</MAP>
<IMG SRC="config.jpg" BORDER=0 usemap="#map_configurer" HEIGHT=480 WIDTH=640>
</CENTER>
<UL>
<LI><A NAME="config_joueur" href="#config_joueur"><B> Configurer joueur</B></A>: Cliquez ici pour changer le num&eacute;ro du
joueur &agrave; configurer. Il y a trois (3) joueurs par ordinateur. Si vous &ecirc;tes plusieurs &agrave;
jouer &agrave; Quadra sur votre ordinateur, vous pourrez donc configurer jusqu'&agrave; concurrence de trois
joueurs avec des param&egrave;tres personnalis&eacute;s. Si vous &ecirc;tes seul, vous devriez normalement
configur&eacute; uniquement le joueur #1.

<LI><A NAME="config_nom" href="#config_nom"><B>Nom </B></A>: C'est ici que vous devrez entrer votre nom de joueur. Le nom
attribu&eacute; par d&eacute;faut est simplement #1 pour le joueur 1, et ainsi de suite. Si vous ne
changez pas votre nom, le jeu pourrait refuser de vous joindre &agrave; une partie car le nom "#1"
pourrait &ecirc;tre d&eacute;j&agrave; utilis&eacute; par quelqu'un d'autre qui a eu la m&ecirc;me id&eacute;e.
Vous pouvez entrer un nom ayant pour longueur maximale la largeur de la bo&icirc;te d'entr&eacute;e.

<LI><A NAME="config_Couleur" href="#config_Couleur"><B>Couleur </B></A>: S&eacute;lectionnez la couleur
de votre choix. Dans Quadra, la couleur d&eacute;signe l'&eacute;quipe. Autrement dit,
tous les joueurs ROUGE pr&eacute;sents dans la partie seront dans la m&ecirc;me &eacute;quipe. <I>En mode solo,
votre couleur n'a aucune importance.</I> En mode multi-joueur, lorsque vous cliquerez sur le bouton
"<B>D&eacute;marrer</B>" pour commencer &agrave; jouer, vous aurez la possibilit&eacute; de changer votre
couleur d'&eacute;quipe en fonction des autres joueurs de cette partie. En d'autres termes, il est
pr&eacute;f&eacute;rable de s&eacute;lectionner sa couleur lors de la partie, et non pas dans ce menu.<BR>
<IMG SRC="souris.gif"> <I>Note pour la souris</I>: dans toutes les zones de s&eacute;lection de Quadra, vous pouvez
appuyer sur le bouton de gauche de la souris pour avancer d'un choix, ou appuyer sur le bouton de droite
pour reculer d'un choix.

<LI><A NAME="config_Ombre" href="#config_Ombre"><B>Ombre </B></A>: Active ou d&eacute;sactive l'ombre
projet&eacute;e par les blocs dans le bas du canevas de jeu. Cette option sert &agrave; aider &agrave; aligner
vos blocs lors de la partie. L'ombre repr&eacute;sente un bloc de couleur fonc&eacute;e situ&eacute;
exactement &agrave; l'endroit o&ugrave; votre bloc se dirige si vous le laissez tomber directement vers le
bas. <BR><CENTER><IMG SRC="ombre.gif"></CENTER>

<LI><A NAME="config_Lisse" href="#config_Lisse"><B>Lisse </B></A>: Active ou d&eacute;sactive le
d&eacute;placement lisse des blocs. Lorsque vous d&eacute;placez le bloc, il "<I>glisse</I>" au lieu
d'appara&icirc;tre imm&eacute;diatement sur la case suivante. Cette option est purement esth&eacute;tique
et n'affecte pas la vitesse ou la pr&eacute;cision des d&eacute;placements.

<LI><A NAME="config_Vitesse clavier" href="#config_Vitesse clavier"><B>Vitesse clavier </B></A>: Sp&eacute;cifie
la vitesse de r&eacute;p&eacute;tition des touches du clavier lors du jeu. Vous avez le choix entre
Lent, Normal, Rapide, ou Turbo. Si vous &ecirc;tes d&eacute;butant, les vitesses Lent ou Normal sont pour vous.
Si vous &ecirc;tes surhumain, essayez Turbo. Dans tous les autres cas, la vitesse Rapide devrait &ecirc;tre
juste &agrave; point pour vous. Prenez garde qu'un joueur qui joue &agrave; une vitesse haute peut d&eacute;poser
beaucoup plus de blocs qu'un joueur qui joue lentement. Il est donc important de s&eacute;lectionner la vitesse
la plus haute possible qui vous convienne. La vitesse de r&eacute;p&eacute;tition affecte
&agrave; la fois les d&eacute;placements lat&eacute;raux et la vitesse de d&eacute;p&ocirc;t des blocs.
La vitesse de rotation n'est pas alt&eacute;r&eacute;e.

<LI><A NAME="config_Changes toutes" href="#config_Changes toutes"><B>Changes toutes </B></A>: Ce bouton
est un raccourci vers les 5 boutons de s&eacute;lection de touche de jeu. Le jeu vous demandera successivement
les 5 touches.
<BR><IMG SRC="keyb.gif"> V<I>ous ne pouvez pas utiliser les touches suivantes: &Eacute;CHAP, PAUSE, RETOUR.</I>

<LI><A NAME="config_Change touche" href="#config_Change touche"><B>Change touche </B></A>: S&eacute;lectionnez
vos touches de contr&ocirc;le pour le jeu.

<LI><A NAME="config_retour" HREF="#menu_principal"><IMG SRC="go_eng.gif" border=0><B> Retour au menu</B></A>:
 Retourne au menu principal. &Eacute;quivalent au clavier: <IMG SRC="keyb.gif"> &Eacute;CHAP.
</UL>

Une fois dans ce menu, vous devriez configurer au minimum le joueur #1. Ensuite,
vous &ecirc;tes pr&ecirc;t &agrave; aller en jouer une! Mais avant d'affronter tous vos amis et adversaires,
il est conseill&eacute; d'aller essayer une partie en mode solo, histoire de v&eacute;rifier si les touches
que vous avez s&eacute;lectionn&eacute;es sont efficaces, la vitesse de r&eacute;p&eacute;tition
ainsi que les diff&eacute;rentes options telle que l'ombre et le mouvement lisse. Donc, vous pouvez aller
jouer une partie solo, puis revenir dans cet &eacute;cran pour ajuster vos param&egrave;tres, jusqu'&agrave;
ce que vous soyez fin pr&ecirc;t pour l'ultime combat. Allons d&eacute;buter une partie solo.

<A NAME="menu_solo" href="#menu_solo"><center><h2>La partie solo</h2></center></A>
Pour d&eacute;buter une partie solo, il faut choisir quelle configuration va &ecirc;tre utilis&eacute;e:
<p><CENTER>
<A href="#solo_1"><IMG SRC="solo.gif" BORDER=0 alt="D&eacute;marrer quelqu'un"></A>
</CENTER>
<UL>
<LI><A NAME="solo_1" HREF="#menu_solo2"><IMG SRC="go_eng.gif" border=0><B> D&eacute;marrer quelqu'un</B></A>: Cette liste de boutons
permet de choisir quel joueur va participer dans cette partie. Si vos 3 choix se nomment respectivement
#1, #2 et #3, vous pourriez revenir au menu de configuration des joueurs et inscrire votre nom :) Notez
qu'&agrave; tout moment pendant ou avant une partie, vous pouvez appuyer sur <IMG SRC="keyb.gif"> &Eacute;CHAP
pour quitter et revenir au menu principal (ou au menu des pointages, si la partie &eacute;tait commenc&eacute;e)
</UL>

<A NAME="menu_solo2" href="#menu_solo2"><center><h2>La partie solo (suite)</h2></center></A>
Voici &agrave; quoi ressemble l'&eacute;cran une fois la partie solo commenc&eacute;e:
<p><CENTER>
<MAP name="map_solo2">
  <area shape="rect" coords="224,1,339,33" href="#solo_blocs suivant" alt="Blocs suivants">
  <area shape="rect" coords="222,36,403,399" href="#solo_blocs" alt="Canevas de jeu">
  <area shape="rect" coords="23,58,152,356" href="#solo_totaux blocs" alt="Totaux blocs">
  <area shape="rect" coords="454,52,575,380" href="#solo_totaux combos" alt="Totaux combos">
  <area shape="rect" coords="217,404,400,479" href="#solo_pointages" alt="Pointages">
</MAP>
<IMG SRC="solo2.jpg" BORDER=0 usemap="#map_solo2" HEIGHT=480 WIDTH=640>
</CENTER>
<UL>
<LI><A NAME="solo_blocs suivant" HREF="#solo_blocs suivant"><B> Blocs suivants</B></A>: Dans le haut de
l'&eacute;cran se situe les 3 blocs qui suivent celui que vous dirigez actuellement. Celui qui suit
imm&eacute;diatement est le plus gros des 3 et se situe au centre du canevas.
<LI><A NAME="solo_blocs" HREF="#solo_blocs"><B> Canevas de jeu</B></A>: Voici le fameux canevas de jeu.
C'est ici que vous dirigez et d&eacute;posez vos blocs dans le but de faire des lignes horizontales.
<LI><A NAME="solo_totaux blocs" HREF="#solo_totaux blocs"><B> Totaux blocs</B></A>: Dans le panneau de gauche,
vos avez le nombre de chaque type de bloc que vous avez d&eacute;pos&eacute; jusqu'&agrave; maintenant.
Il y a aussi le total des blocs d'indiqu&eacute; au bas.

<LI><A NAME="solo_totaux combos" HREF="#solo_totaux combos"><B> Totaux combos</B></A>: Dans le panneau de droite
se trouve le nombre de combo de ligne que vous avez effectu&eacute; au cours de cette partie. Chaque fois
que vous d&eacute;posez un bloc qui compl&egrave;te une ligne horizontale, vous accumulez un "Simple".
Si vous faites deux lignes simultan&eacute;ment, vous accumulez un "Double", et ainsi de suite.

<LI><A NAME="solo_pointages" HREF="#solo_pointages"><B> Pointages</B></A>: En dessous du canevas, vos
avez vos informations actuelles: score, total de ligne, et niveau de difficult&eacute;.
</UL>

Vous voici pr&ecirc;t &agrave; jouer! D&eacute;posez vos blocs et obtenez des points. C'est simple non?
L&agrave; o&ugrave; les choses se compliquent, c'est lorsque vous essayez de faire <B>beaucoup</B> de points.
Et c'est l&agrave; qu'interviennent les guides de strat&eacute;gie pour partie solo et multi-joueur. Dans
ces guides, vous trouverez toute l'information requise pour faire un pointage monstre! Dans tous les cas,
lorsque vous finirez par tr&eacute;passer (dans le jeu j'entends), vous irez droit au menu des meilleurs
pointages.

<A NAME="menu_pointage" href="#menu_pointage"><center><h2>Le menu des meilleurs pointages</h2></center></A>
<p><CENTER>
<MAP name="map_pointage">
  <area shape="rect" coords="59,69,597,171" href="#point_Pointages mondiaux" alt="Pointages mondiaux">
  <area shape="rect" coords="28,185,605,206" href="#point_Valider" alt="Valider">
  <area shape="rect" coords="57,277,597,377" href="#point_Pointages locaux" alt="Pointages locaux">
  <area shape="rect" coords="61,387,597,405" href="#point_derni" alt="Derni&egrave;re solo">
  <area shape="rect" coords="51,415,193,453" href="#point_Rejouer" alt="Rejouer">
  <area shape="rect" coords="490,417,622,448" href="#point_Retour" alt="Retour">
</MAP>
<IMG SRC="pointage.jpg" BORDER=0 usemap="#map_pointage" HEIGHT=480 WIDTH=640>
</CENTER>
<UL>
<LI><A NAME="point_Pointages mondiaux" HREF="#point_Pointages mondiaux"><B> Pointages mondiaux</B></A>:
Liste des 5 meilleurs pointages mondiaux. Cette liste peut &ecirc;tre vide si vous n'avez pas d'acc&egrave;s
&agrave; l'Internet. Un bouton "Visionner" &agrave; droite de chaque pointage permet de regarder la partie
se d&eacute;rouler devant vous. Vous aurez la possibilit&eacute; de la faire jouer au ralenti (pour observer
en d&eacute;tail une s&eacute;quence int&eacute;ressante) ou en acc&eacute;l&eacute;r&eacute;.

<LI><A NAME="point_Valider" HREF="#point_Valider"><B> Valider</B></A>: <B>Attention</B>: Ce bouton n&eacute;cessite
une connexion &agrave; l'Internet. Si tout fonctionne correctement, Quadra va transmettre votre meilleur
pointage au serveur de partie publique, et ensuite t&eacute;l&eacute;charger les 5 meilleurs parties. Vous
devrez patientez quelques secondes durant le transfert. Si votre partie &eacute;tait excellente, il se
peut que vous soyez dans la liste des meilleurs parties &agrave; travers le monde, et tous pourront
regarder votre exploit &agrave; leur guise.

<LI><A NAME="point_Pointages locaux" HREF="#point_Pointages locaux"><B> Pointages locaux</B></A>:
Cette liste illustre les 5 meilleures parties qui ont &eacute;t&eacute; jou&eacute; sur cet ordinateur.
Cliquez sur "Visionner" pour regarder les performances.

<LI><A NAME="point_derni" HREF="#point_derni"><B> Derni&egrave;re solo</B></A>: Ce bouton vous permet
de regarder votre toute derni&egrave;re partie.
<BR><I>Note: ce bouton ne sera pas pr&eacute;sent si votre partie est dans les 5 meilleures.</I>

<LI><A NAME="point_Rejouer" HREF="#point_Rejouer"><B> Rejouer</B></A>: Appuyez ici pour recommencer une
nouvelle partie solo.

<LI><A NAME="point_Retour" HREF="#menu_principal"><IMG SRC="go_eng.gif" border=0><B> Retour</B></A>:
 Retourne au menu principal. &Eacute;quivalent au clavier: <IMG SRC="keyb.gif"> &Eacute;CHAP.
</UL>

Maintenant que vous savez jouer &agrave; Quadra, et que vous &ecirc;tes m&ecirc;me en mesure de faire
des pointages &eacute;poustouflants, vous avez s&ucirc;rement envie d'aller affronter quelques autres
personnes! Dirigeons-nous vers le menu multi-joueur pour en apprendre son fonctionnement.

<A NAME="menu_multi" href="#menu_multi"><center><h2>Organiser une partie multi-joueur</h2></center></A>
Avant de commencer, il faut faire un choix:
<p><CENTER>
<MAP name="map_multi">
  <area shape="rect" coords="10,9,209,28" href="#multi_1_local" alt="Mode local (pas de r&eacute;seau)">
  <area shape="rect" coords="8,49,215,70" href="#multi_1_lan" alt="TCP/IP r&eacute;seau LAN">
  <area shape="rect" coords="47,91,174,111" href="#multi_1_internet" alt="TCP/IP r&eacute;seau Internet">
</MAP>
<IMG SRC="multi.gif" BORDER=0 usemap="#map_multi">
</CENTER>
<UL>
<LI><A NAME="multi_1_local" HREF="#menu_create"><IMG SRC="go_eng.gif" border=0><B> Mode local (pas de r&eacute;seau)</B></A>:
Ce bouton sert &agrave; cr&eacute;er une partie multi-joueur sur votre ordinateur. Vous pouvez jouer jusqu'&agrave;
3 joueurs simultan&eacute;ment (en souhaitant que vous ayez tous des touches de clavier diff&eacute;rentes).
Vous n'avez pas besoin d'&ecirc;tre connect&eacute; en r&eacute;seau pour utiliser ce mode de jeu.<BR>
<I>Astuce: on peut aussi utiliser ce mode pour se pratiquer seul. &Eacute;tant donn&eacute; que la partie sera
en mode multi-joueur, vous pourrez recommencer aussi souvent que vous le voulez, ce qui est plus pratique
que le mode solo. Par contre, vous ne pourrez pas obtenir votre nom de la liste des meilleurs pointages.</I>

<LI><A NAME="multi_1_lan" HREF="#menu_connect"><IMG SRC="go_eng.gif" border=0><B> TCP/IP r&eacute;seau LAN</B></A>:
Cliquez sur ce bouton-ci pour jouer une partie en r&eacute;seau avec d'autres ordinateurs sur un r&eacute;seau
local. Vous devez avoir le protocole TCP/IP install&eacute; dans votre syst&egrave;me d'exploitation.<BR>
<IMG SRC="doze.gif">Utilisateurs Windows: pour savoir ce protocole est install&eacute; dans votre syst&egrave;me,
ouvrez les propri&eacute;t&eacute;s du r&eacute;seau <IMG SRC="icon_reseau.gif"> du panneau de configuration.
Vous devriez obtenir une fen&ecirc;tre qui ressemble &agrave; celle-ci:<BR>
<CENTER><IMG SRC="doze_property.gif"></CENTER><BR>
V&eacute;rifiez que vous avez bien un protocole TCP/IP dans la liste. Celui qui s'appelle "Carte d'acc&egrave;s distant"
sert &agrave; vous connecter &agrave; l'Internet. Si vous avez une carte r&eacute;seau dans votre ordinateur,
il est possible de voir un deuxi&egrave;me TCP/IP (ou m&ecirc;me davantage). Si vous avez du trouble &agrave;
faire fonctionner Quadra dans ce mode multi-joueur, envoyez un courriel &agrave; notre support technique:
<A HREF="mailto:support@ludusdesign.com">support@ludusdesign.com</A>

<LI><A NAME="multi_1_internet" HREF="#menu_connect"><IMG SRC="go_eng.gif" border=0><B> TCP/IP r&eacute;seau Internet</B></A>:
Semblable au mode TCP/IP LAN, ce mode de jeu vous permet de vous connecter avec d'autres ordinateurs en
utilisant le protocole TCP/IP. En plus, ce mode offre la possibilit&eacute; de cr&eacute;er des parties
dites "<EM>publiques</EM>" qui pourront &ecirc;tre vues &agrave; travers le monde entier.
</UL>

<A NAME="menu_create" href="#menu_create"><center><h2>Cr&eacute;er une partie multi-joueur</h2></center></A>
L'&eacute;cran de cr&eacute;ation d'une partie multi-joueur local, LAN ou Internet:
<p><CENTER>
<MAP name="map_create">
  <area shape="rect" coords="340,90,579,110" href="#creation_nom" alt="Nom">
  <area shape="rect" coords="340,120,390,138" href="#creation_publique" alt="Publique Oui/Non">
  <area shape="rect" coords="341,159,482,181" href="#creation_type" alt="Type de partie">
  <area shape="rect" coords="339,238,437,261" href="#creation_niveau" alt="Changement de niveau">
  <area shape="rect" coords="339,270,391,291" href="#creation_depart" alt="Niveau de d&eacute;part">
  <area shape="rect" coords="341,299,416,321" href="#creation_attaque" alt="Lignes pour attaquer">
  <area shape="rect" coords="339,329,525,349" href="#creation_termine" alt="Termine quand">
  <area shape="rect" coords="340,360,622,380" href="#creation_demo" alt="Enregistre la partie">
  <area shape="rect" coords="251,389,393,409" href="#creation_creer" alt="Cr&eacute;er">
  <area shape="rect" coords="17,448,251,472" href="#creation_enreg" alt="Enregistrer">
  <area shape="rect" coords="558,450,639,470" href="#creation_retour" alt="Retour">
</MAP>
<IMG SRC="creation.jpg" BORDER=0 usemap="#map_create">
</CENTER>
<UL>
<LI><A NAME="creation_nom" HREF="#creation_nom"><B> Nom</B></A>:
Entrez le nom de la partie.<BR>
<I>Note: en mode local, cet item n'est pas disponible.</I>

<LI><A NAME="creation_publique" HREF="#creation_publique"><B> Publique Oui/Non</B></A>:
Permet ou non la visibilit&eacute; de votre partie &agrave; travers l'Internet. Quadra "parlera"
avec le serveur de partie publique indiqu&eacute; dans les <A HREF="#creation_creer">options</A>
pour signaler la cr&eacute;ation de votre partie. Ainsi, les autres personnes qui consulteront la
liste des parties disponibles verront la v&ocirc;tre. Choisissez "Non" si vous ne voulez pas la rendre
publique. Notez que vos amis pourront tout de m&ecirc;me se joindre &agrave; votre partie si vous leur
communiquer votre adresse IP. Cela vous permet de faire des parties priv&eacute;es.<BR>
<I>Note: en mode local et en mode LAN, cet item n'est pas disponible.</I>

<LI><A NAME="creation_type" HREF="#creation_type"><B> Type de partie</B></A>:
Il y a 2 types de parties:
<UL><LI><B>Partie libre</B>: Obtenez des points (frags) pour chaque adversaire que vous tuez. Si vous mourez,
vous n'aurez alors qu'&agrave; appuyer sur une de vos touches pour recommencer de plus bel.<BR>
<IMG SRC="reso.gif"> <I>Utilisateurs avanc&eacute;s: pour comprendre le fonctionnement des <B>frags</B>,
<A href="#blabla"> cliquez ici.</A></I>
<LI><B>Dernier survivant</B>: Similaire au mode <I>Partie libre</I>, except&eacute; que vous ne pouvez pas
recommencer imm&eacute;diatement apr&egrave;s avoir &eacute;t&eacute; tu&eacute;. Vous devrez attendre la fin
de la manche, qui se termine lorsqu'un joueur (ou son &eacute;quipe) devient le dernier survivant. Ensuite,
tous les joueurs seront automatiquement red&eacute;marr&eacute;s pour la manche suivante.
Pendant que vous patientez, profitez-en pour observer vos ennemis ou pour encourager vos co&eacute;quipiers qui
sont encore en vie :)
</UL>

<LI><A NAME="creation_niveau" HREF="#creation_niveau"><B> Changement de niveau</B></A>:
D&eacute;termine si le niveau de difficult&eacute; du jeu augmente &agrave; chaque fois que vous
avez obtenu 15 lignes. Cette option peut s'av&eacute;rer utile si vous jouez contre quelqu'un de trop
fort et qui semble invincible (surtout en mode "Partie libre); ainsi, plus il joue longtemps, plus son
niveau de difficult&eacute; augmentera, et il finira bien par crever!

<LI><A NAME="creation_depart" HREF="#creation_depart"><B> Niveau de d&eacute;part</B></A>:
S&eacute;lectionnez le niveau de difficult&eacute; de d&eacute;part. Plus vous s&eacute;lectionnez un
niveau &eacute;lev&eacute;, plus la vitesse de descente des blocs sera rapide.
<I>Conseil: vous devriez laisser le niveau &agrave; 1 si vous jouez avec des d&eacute;butants.</I>

<LI><A NAME="creation_attaque" HREF="#creation_attaque"><B> Lignes pour attaquer</B></A>:
Le nombre de ligne requis pour attaquer les adversaires. La valeur par d&eacute;faut &eacute;tant un
"double". Ce qui signifit que tout ce qui est moins qu'un double (exemple: un simple) n'attaquera
pas les adversaires. Plus vous s&eacute;lectionnez un nombre &eacute;lev&eacute;, plus il sera difficile
d'attaquer ses adversaires.
<BR><I>Conseil: vous devriez laisser le niveau &agrave; "double" si vous jouez avec des d&eacute;butants.</I>
<BR><I>Autre conseil: vous pourrez exp&eacute;rimenter un niveau plus &eacute;lev&eacute; si vous voulez jouer
contre plusieurs adversaires de calibre expert. Par exemple, si vous choisissez "5-lignes" comme minimum, vous
vous trouverez alors &agrave; "calmer" beaucoup les petits &eacute;changes de lignes.</I>

<LI><A NAME="creation_termine" HREF="#creation_termine"><B> Termine quand</B></A>:
Indique &agrave; quel moment la partie doit prendre fin. Vous avez le choix parmi:
<UL><LI><B>Jamais</B>: le serveur (cr&eacute;ateur) de la partie devra la terminer manuellement.
<LI><B>Apr&egrave;s "X" frags</B>: lorsqu'une &eacute;quipe aura atteint X frags.
<LI><B>Apr&egrave;s "X" minutes</B>: un compte &agrave; rebours indiquera le temps restant.
</UL>

<LI><A NAME="creation_demo" HREF="#creation_demo"><IMG SRC="go_eng.gif" border=0><B> Enregistre la partie</B></A>:
Si vous d&eacute;sirez enregistrer cette partie pour la conserver. Entrez un nom de fichier dans la
bo&icirc;te de texte qui appara&icirc;tra.<BR>
<I>Note: Quadra ajoute automatiquement l'extension <B>.REC</B> aux fichiers de d&eacute;mo.</I>

<LI><A NAME="creation_creer" HREF="#creation_creer"><IMG SRC="go_eng.gif" border=0><B> Cr&eacute;er</B></A>:
Cr&eacute;er la partie et vous transporte dans l'&eacute;cran de jeu multi-joueur.

<LI><A NAME="creation_enreg" HREF="#creation_enreg"><B> Enregistrer</B></A>:
Sert &agrave; conserver ces param&egrave;tres de cr&eacute;ation de partie par d&eacute;faut.

<LI><A NAME="creation_retour" HREF="#menu_multi"><IMG SRC="go_eng.gif" border=0><B> Retour</B></A>:
Retourne au menu pr&eacute;c&eacute;dent.
</UL>

<A NAME="menu_connect" href="#menu_connect"><center><h2>Multi-joueur TCP/IP: Cr&eacute;er ou joindre</h2></center></A>
L'&eacute;cran de connexion pour partie multi-joueur LAN ou Internet:
<p><CENTER>
<MAP name="map_connect">
  <area shape="rect" coords="245,49,401,70" href="#connect_creer" alt="Cr&eacute;er">
  <area shape="rect" coords="212,79,434,98" href="#connect_refr" alt="Rafra&icirc;chir la liste">
  <area shape="rect" coords="234,121,635,246" href="#connect_info" alt="Informations d'une partie">
  <area shape="rect" coords="3,141,220,380" href="#connect_list" alt="Liste des parties">
  <area shape="rect" coords="235,252,622,388" href="#connect_joueur" alt="Liste des joueurs d'une partie">
  <area shape="rect" coords="197,394,448,414" href="#connect_joindre" alt="Joindre">
  <area shape="rect" coords="340,421,581,441" href="#connect_ip" alt="Connecter &agrave; une adresse">
  <area shape="rect" coords="31,449,192,469" href="#connect_infoip" alt="Information IP">
  <area shape="rect" coords="558,448,641,469" href="#connect_retour" alt="Retour">
</MAP>
<IMG SRC="connect.jpg" BORDER=0 usemap="#map_connect">
</CENTER>
<UL>
<LI><A NAME="connect_creer" HREF="#menu_create"><IMG SRC="go_eng.gif" border=0><B> Cr&eacute;er</B></A>:
Cliquez l&agrave;-dessus pour cr&eacute;er une nouvelle partie dont vous serez le serveur et l'administrateur.

<LI><A NAME="connect_refr" HREF="#connect_refr"><B> Rafra&icirc;chir la liste</B></A>:
Sert &agrave; mettre &agrave; jour la liste des parties.

<LI><A NAME="connect_info" HREF="#connect_info"><B> Informations d'une partie</B></A>:
Donne les renseignements sur la partie s&eacute;lectionn&eacute;e dans la liste de gauche.

<LI><A NAME="connect_list" HREF="#connect_list"><B> Liste des parties</B></A>:
Ici sont list&eacute;es les parties pr&eacute;sentement disponibles. Cliquez sur le nom d'une partie
pour la s&eacute;lectionner.

<LI><A NAME="connect_joueur" HREF="#connect_joueur"><B> Liste des joueurs d'une partie</B></A>:
Affiche la liste des joueurs actuellement pr&eacute;sents dans la partie s&eacute;lectionn&eacute;e.

<LI><A NAME="connect_joindre" HREF="#connect_joindre"><B> Joindre</B></A>:
Cliquez ici pour vous joindre &agrave; une partie.

<LI><A NAME="connect_ip" HREF="#connect_ip"><B> Connecter &agrave; une adresse</B></A>:
Vous pouvez entrer directement une adresse IP ou une adresse URL &agrave; laquelle se trouve un serveur
de partie Quadra.
<BR><I>Note: en mode TCP/IP Internet, un bouton suppl&eacute;mentaire nomm&eacute; "Carnet d'adresse" sera
disponible. Ce bouton vous permet d'entrer vos adresses IP les plus fr&eacute;quemment utilis&eacute;es.</I>

<LI><A NAME="connect_infoip" HREF="#connect_infoip"><B> Information IP</B></A>:
Cliquez ici pour afficher votre adresse IP personnelle. Vous pouvez avoir plus d'une adresse selon votre
configuration r&eacute;seau.

<LI><A NAME="connect_retour" HREF="#menu_multi"><IMG SRC="go_eng.gif" border=0><B> Retour</B></A>:
Retourne au menu pr&eacute;c&eacute;dent.
</UL>

Lorsque vous entrez dans cet &eacute;cran, une recherche automatique des parties en cours s'effectue. Si
vous &ecirc;tes sur le mode TCP/IP Internet, cette recherche &agrave; lieu en se connectant au serveur de
partie publique. Celui retourne comme r&eacute;sultat la liste des parties publiques existantes
actuellement. Si vous &ecirc;tes en mode LAN, la recherche s'effectue &agrave; travers le r&eacute;seau
local en utilisant un signal "<I>broadcast</I>". Il se peut qu'en fonction de votre configuration LAN,
le signal broadcast ne fonctionne pas. Il vous sera alors impossible de voir la liste des parties, mais vous
pourrez tout de m&ecirc;me vous connecter &agrave; une partie. Il vous suffit d'entrer directement l'adresse
IP de l'ordinateur serveur dans la zone situ&eacute;e dans le bas de l'&eacute;cran.
<BR>En principe, si la recherche a fonctionn&eacute; et qu'il y a des parties disponibles, vous verrez alors
la liste appara&icirc;tre. Il vous suffit de cliquer sur le nom d'une partie pour la s&eacute;lectionner, puis
ensuite cliquez sur le bouton "Joindre la partie" pour vous y joindre. <IMG SRC="souris.gif"> <I>Note pour la souris:
vous pouvez faire un double-clique sur le nom de la partie.</I>
<BR>Note: si la partie que vous avez s&eacute;lectionn&eacute;e a &eacute;t&eacute; cr&eacute;&eacute;e par
un serveur Quadra qui n'est pas exactement de la m&ecirc;me version que le v&ocirc;tre, vous ne pourrez pas joindre
celle-ci. Allez sur notre site web pour consulter les plus r&eacute;centes mises &agrave; jour
de Quadra &agrave; l'adresse <A href="http://www.ludusdesign.com/quadra_fr.html">http://www.ludusdesign.com/quadra_fr.html</A>.
<BR>Dans tous les cas, quand vous aurez fini par joindre ou cr&eacute;er une partie, vous arriverez dans
l'&eacute;cran du jeu multi-joueur, qui sera d&eacute;crit ci-dessous.

<A NAME="pane" href="#pane"><center><h2>L'&eacute;cran de jeu multi-joueur</h2></center></A>
Pour &ecirc;tre flexible au maximum, l'&eacute;cran de jeu multi-joueur est en fait compos&eacute; de
3 panneaux ind&eacute;pendants. Chacun de ces panneaux peut &ecirc;tre ferm&eacute; &agrave; tout
moment en cliquant sur le bouton "Fermer" situ&eacute; directement au-dessus. Vous pouvez ainsi configurer
l'&eacute;cran comme bon vous semble, en ouvrant et fermant ces panneaux. Voici le panneau principal:
<p><CENTER>
<MAP name="map_pane">
  <area shape="rect" coords="8,38,184,98" href="#pane_start" alt="D&eacute;marrer un joueur">
  <area shape="rect" coords="8,126,185,148" href="#pane_show" alt="Affiche les joueurs">
  <area shape="rect" coords="7,149,184,170" href="#pane_bloc" alt="Information blocs">
  <area shape="rect" coords="6,171,185,191" href="#pane_line" alt="Information lignes">
  <area shape="rect" coords="6,192,185,213" href="#pane_theme" alt="Choisir le th&egrave;me">
  <area shape="rect" coords="7,215,184,236" href="#pane_chat" alt="Fen&ecirc;tre de chat">
  <area shape="rect" coords="8,259,182,281" href="#pane_net" alt="Fonctions du r&eacute;seau">
  <area shape="rect" coords="126,420,208,443" href="#pane_ret" alt="Quitte">
</MAP>
<IMG SRC="pane.gif" BORDER=0 usemap="#map_pane">
</CENTER>
<UL>
<LI><A NAME="pane_start" HREF="#pane_start2"><IMG SRC="go_eng.gif" border=0><B> D&eacute;marrer un joueur</B></A>:
Cliquer sur un de ces boutons pour d&eacute;marrer un joueur.
<BR><I>Note: si un joueur a d&eacute;j&agrave; &eacute;t&eacute; d&eacute;marr&eacute; mais que le panneau avait
&eacute;t&eacute; ferm&eacute;, le mot "D&eacute;marrer" sera remplac&eacute; par "Continuer" pour signaler
que ce joueur est en cours.</I>

<LI><A NAME="pane_show" HREF="#pane_show2"><IMG SRC="go_eng.gif" border=0><B> Affiche les joueurs</B></A>:
Affiche le panneau r&eacute;sum&eacute; de la liste des joueurs. C'est aussi dans ce panneau que vous
pourrez observer vos adversaires.

<LI><A NAME="pane_bloc" HREF="#pane_bloc2"><IMG SRC="go_eng.gif" border=0><B> Information blocs</B></A>:
Affiche le panneau des statistiques de blocs qui ont &eacute;t&eacute; d&eacute;pos&eacute;s.

<LI><A NAME="pane_line" HREF="#pane_line2"><IMG SRC="go_eng.gif" border=0><B> Information lignes</B></A>:
Similaire au panneau des blocs, mais avec les lignes accomplies par joueur.

<LI><A NAME="pane_theme" HREF="#pane_theme2"><B> Choisir le th&egrave;me</B></A>:
Permet de s&eacute;lectionner l'image de fond et les effets sonores en fonction du niveau de 1 &agrave; 10.
<BR><I>Note: pour pouvoir choisir un th&egrave;me, vous devez l'avoir atteint pr&eacute;alablement
en mode solo! Par exemple, pour pouvoir choisir le th&egrave;me du niveau 8, vous devez avoir r&eacute;ussi
&agrave; vous rendre jusqu'au niveau 8 dans une partie solo.</I>

<LI><A NAME="pane_chat" HREF="#pane_chat2"><IMG SRC="go_eng.gif" border=0><B> Fen&ecirc;tre de chat</B></A>:
Ouvre le panneau de dialogue (<I>chat</I>).
<BR><I>Note: ce bouton n'est visible qu'en mode multi-joueur TCP/IP (LAN ou Internet)</I>

<LI><A NAME="pane_net" HREF="#pane_net2"><IMG SRC="go_eng.gif" border=0><B> Fonctions du r&eacute;seau</B></A>:
Affiche le panneau des fonctions relatives au r&eacute;seau.
<BR><I>Note: ce bouton n'est visible qu'en mode multi-joueur TCP/IP (LAN ou Internet)</I>

<LI><A NAME="pane_ret" HREF="#menu_result"><IMG SRC="go_eng.gif" border=0><B> Quitte</B></A>:
Ceci met fin &agrave; votre joueur (ou vos joueurs) et vous transporte dans l'&eacute;cran des r&eacute;sultats.
Si la partie ne contenait aucun joueur, ce bouton vous ram&egrave;ne au menu pr&eacute;c&eacute;dent. Notez
que si vous &ecirc;tes serveur, ceci ne termine pas la partie: les autres ordinateurs pourront
continuer de jouer, tant que vous ne signalerez pas la fin de partie (voir le menu des r&eacute;sultats).
<BR><I>Note: ce bouton n'est visible que lorsque le panneau de droite est ferm&eacute;.</I>
</UL>

D&egrave;s que vous entrez dans l'&eacute;cran de jeu multi-joueur, vous pouvez commencer &agrave; manipuler
les panneaux &agrave; votre guise. Si la partie vient tout juste d'&ecirc;tre cr&eacute;er, vous apercevrez
au centre de l'&eacute;cran le mot "Pause" ressemblant un peu &agrave; ceci:
<BR><CENTER>
<img src="pause.gif" border=0>
</CENTER>
<BR>Ce dernier indique que la partie est temporairement suspendue, ou encore quelle n'est pas commenc&eacute;e.
Seul le serveur peut signaler le d&eacute;part en appuyant sur la touche <IMG SRC="keyb.gif"> PAUSE. Un
d&eacute;compte de 5 secondes s'en suivra, puis la partie d&eacute;butera pour de bon. Si vous voulez
temporairement suspendre la partie, vous n'avez qu'&agrave; appuyer sur PAUSE. Par la suite, aucun autre joueur ne pourra
enlever la fonction pause &agrave; part le serveur et vous-m&ecirc;me. Autrement dit, si le serveur d&eacute;cide
de mettre pause, personne d'autre ne peut l'enlever.
<BR><I>Note: le jeu d&eacute;bute sur PAUSE en mode multi-joueur TCP/IP (LAN ou Internet) seulement.</I>

<A NAME="pane_start2" href="#pane_start2"><center><h2>Multi-joueur: d&eacute;marrer un joueur</h2></center></A>
<p><CENTER>
<MAP name="map_pane_start">
  <area shape="rect" coords="8,18,200,41" href="#pane_start_go" alt="D&eacute;marrer">
  <area shape="rect" coords="26,97,181,119" href="#pane_start_equipe" alt="Choisir l'&eacute;quipe">
  <area shape="rect" coords="17,164,194,365" href="#pane_start_joueur" alt="Joueurs dans l'&eacute;quipe">
</MAP>
<IMG SRC="panestar.gif" BORDER=0 usemap="#map_pane_start">
</CENTER>
<UL>
<LI><A NAME="pane_start_go" HREF="#pane_play"><IMG SRC="go_eng.gif" border=0><B> D&eacute;marrer</B></A>:
D&eacute;marre ce joueur dans l'&eacute;quipe indiqu&eacute;e par la couleur s&eacute;lectionn&eacute;e.
Ce bouton demande la permission au serveur pour d&eacute;marrer un nouveau joueur. Il se peut que le
serveur rejette votre demande. Voici les raisons possibles:
<UL>
<LI><B>Le serveur refuse les joueurs</B>: Le cr&eacute;ateur de partie refuse les nouveaux joueurs. Peut &ecirc;tre
que vous devriez tenter de dialoguer avec lui dans la fen&ecirc;tre de chat pour demander l'autorisation.
<LI><B>Nom d&eacute;j&agrave; utilis&eacute;</B>: Un joueur utilisant exactement le m&ecirc;me nom que vous existe
d&eacute;j&agrave; dans la partie. Vous devez changer de nom pour pouvoir joindre cette partie, ou
demander &agrave; l'administrateur d'&eacute;liminer le joueur pour vous laisser la place.
<LI><B>La partie est termin&eacute;e</B>: Si cette partie est d&eacute;j&agrave; termin&eacute;e, vous ne pouvez
plus joindre de joueur.
</UL>

<LI><A NAME="pane_start_equipe" HREF="#pane_start_equipe"><B> Choisir l'&eacute;quipe</B></A>:
Cliquez ici pour changer d'&eacute;quipe avant de vous joindre &agrave; la partie. Vous avez l'opportunit&eacute;
de constater quels joueurs sont d&eacute;j&agrave; dans la partie, ou encore quelle &eacute;quipe semble le plus avoir
besoin de votre coup de main.

<LI><A NAME="pane_start_joueur" HREF="#pane_start_joueur"><B> Joueurs dans l'&eacute;quipe</B></A>:
Cette liste illustre les joueurs d&eacute;j&agrave; pr&eacute;sents dans l'&eacute;quipe
que vous avez pr&eacute;sentement s&eacute;lectionn&eacute;e.
</UL>

Particularit&eacute;: si vous &eacute;tiez d&eacute;j&agrave; dans une partie et que, pour une raison ou pour
une autre, votre connexion a &eacute;t&eacute; interrompue, vous pouvez revenir dans la partie. Votre nom
devrait &ecirc;tre d&eacute;j&agrave; dans la liste des joueurs (&agrave; moins que le serveur n'aie d&eacute;cid&eacute;
de vous &eacute;liminer). Pour continuer en conservant vos statistiques, il s'agit de re-joindre la m&ecirc;me
partie en utilisant la <B>m&ecirc;me couleur d'&eacute;quipe que vous utilisiez d&eacute;j&agrave;</B>. Sinon,
Quadra consid&egrave;re que vous &ecirc;tes un nouveau joueur, et va remettre toutes les statistiques &agrave; z&eacute;ro.
<BR>Toutefois, au moment o&ugrave; vous aviez sorti (volontairement ou involontairement), vous allez &ecirc;tre
consid&eacute;r&eacute; comme quelqu'un de mort. En mode dernier survivant, cela pourrait avoir pour effet de
terminer une manche, consid&eacute;rant que vous &eacute;tiez <I>le</I> seul adversaire encore vivant.

<A NAME="pane_play" href="#pane_play"><center><h2>Multi-joueur: un joueur en cours de partie</h2></center></A>
Ce panneau devrait vous sembler familier si vous avez lu la section sur le mode solo:
<p><CENTER>
<MAP name="map_pane_play">
  <area shape="rect" coords="14,0,120,35" href="#pane_play_next" alt="Blocs suivants">
  <area shape="rect" coords="140,8,205,30" href="#pane_play_ferme" alt="Ferme">
  <area shape="rect" coords="3,36,184,399" href="#pane_play_canvas" alt="Canevas de jeu">
  <area shape="rect" coords="186,34,204,398" href="#pane_play_bonus" alt="Lignes en attente">
  <area shape="rect" coords="1,404,204,479" href="#pane_play_info" alt="Vos informations">
</MAP>
<IMG SRC="paneplay.gif" BORDER=0 usemap="#map_pane_play">
</CENTER>
<UL>
<LI><A NAME="pane_play_next" HREF="#pane_play_next"><B> Blocs suivants</B></A>:
Cette zone illustre les 3 blocs suivant celui que vous contr&ocirc;ler pr&eacute;sentement.

<LI><A NAME="pane_play_ferme" HREF="#pane"><IMG SRC="go_eng.gif" border=0><B> Ferme</B></A>:
Ce bouton ferme le panneau et retourne au panneau principal.

<LI><A NAME="pane_play_canvas" HREF="#pane_play_canvas"><B> Canevas de jeu</B></A>:
Cette dans cette r&eacute;gion que vous d&eacute;posez all&egrave;grement vos blocs.

<LI><A NAME="pane_play_bonus" HREF="#pane_play_bonus"><B> Lignes en attente</B></A>:
Cette zone indique combien de lignes vous allez recevoir de vos adversaires. Plus la colonne devient
haute, plus vous recevrez de lignes lorsque vous d&eacute;poserez votre prochain bloc. Utilisez cette
information judicieusement, votre survie en d&eacute;pendra!

<LI><A NAME="pane_play_info" HREF="#pane_play_info"><B> Vos informations</B></A>:
Dans le bas de l'&eacute;cran, vous verrez vos informations courantes:
<UL>
<LI><B>Score</B>: Indique votre pointage actuel.
<LI><B>Lignes</B>: Un premier champ indique le nombre de ligne accomplie au cours de cette vie, tandis que l'autre
indique le nombre cumulatif de ligne accompli au cours de la partie.
<LI><B>Frags</B>: Indique le nombre d'adversaire que vous avez tu&eacute; sans piti&eacute;. Pour
tuer quelqu'un, il faut lui envoyer des lignes et provoquer son d&eacute;c&egrave;s. Pour savoir exactement
comment fonctionne les frags, consultez le guide de strat&eacute;gie multi-joueur.
<LI><B>Morts</B>: Indique le nombre de fois que vous &ecirc;tes mort.
<LI><B>Niveau</B>: Votre niveau de difficult&eacute;.
</UL>
</UL>

<A NAME="pane_show2" href="#pane_show2"><center><h2>Multi-joueur: afficher les joueurs</h2></center></A>
<p><CENTER>
<MAP name="map_pane_show">
  <area shape="rect" coords="4,13,183,88" href="#pane_show_list" alt="Liste des joueurs">
  <area shape="rect" coords="76,375,198,396" href="#pane_show_quoi" alt="Affiche quoi">
</MAP>
<IMG SRC="paneshow.gif" BORDER=0 usemap="#map_pane_show">
</CENTER>
<UL>
<LI><A NAME="pane_show_list" HREF="#pane_show_list"><B> Liste des joueurs</B></A>:
Liste des joueurs actifs dans la partie pr&eacute;sentement. Les joueurs provenant des autres ordinateurs
connect&eacute;s &agrave; cette partie seront inscrits dans un bouton. Vous pouvez cliquer sur le nom d'un
de ces joueurs, puis ensuite cliquer sur le bouton "Observe s&eacute;lectionn&eacute;s" pour les voir en pleine action. Si vous
s&eacute;lectionnez seulement 1 joueur, il sera affich&eacute; en pleine grandeur dans le panneau. Si vous
en s&eacute;lectionnez 2,3 ou 4, ils seront affich&eacute;s en format r&eacute;duit.
<BR><I>Note: vous ne pouvez pas observer un joueur qui a &eacute;t&eacute; d&eacute;connect&eacute; ou qui
a quitt&eacute; la partie.</I>

<LI><A NAME="pane_show_quoi" HREF="#pane_show_quoi"><B> Affiche quoi</B></A>:
Cliquez ici pour changer quel renseignement sera affich&eacute; &agrave; droite de chaque nom de joueur.
Vous pouvez choisir parmi: Frags & Morts, Score, Blocs, et Lignes.
</UL>

<A NAME="pane_bloc2" href="#pane_bloc2"><center><h2>Multi-joueur: affiche les statistiques de blocs</h2></center></A>
<p><CENTER>
<MAP name="map_pane_bloc">
  <area shape="rect" coords="2,25,183,327" href="#pane_bloc_info" alt="Totaux par bloc">
  <area shape="rect" coords="1,389,204,435" href="#pane_bloc_qui" alt="Joueur vs joueur">
</MAP>
<IMG SRC="panebloc.gif" BORDER=0 usemap="#map_pane_bloc">
</CENTER>
<UL>
<LI><A NAME="pane_bloc_info" HREF="#pane_bloc_info"><B> Totaux par bloc</B></A>:
Indique le nombre de bloc de chaque type qui ont &eacute;t&eacute; d&eacute;pos&eacute; au cours de la
partie, ainsi que le total de tous les blocs. Vous pouvez comparer la vitesse d'un joueur par rapport &agrave;
un autre en regardant lequel a d&eacute;pos&eacute; le plus de bloc. Toutefois, il est possible que les deux
joueurs n'aient pas commenc&eacute; &agrave; jouer au m&ecirc;me moment.

<LI><A NAME="pane_bloc_qui" HREF="#pane_bloc_qui"><B> Joueur vs joueur</B></A>:
Cliquez sur le nom d'un joueur pour passer au joueur suivant.
</UL>

<A NAME="pane_line2" href="#pane_line2"><center><h2>Multi-joueur: affiche les statistiques de lignes</h2></center></A>
<p><CENTER>
<MAP name="map_pane_line">
  <area shape="rect" coords="2,25,183,347" href="#pane_line_info" alt="Totaux des lignes">
  <area shape="rect" coords="1,389,204,435" href="#pane_line_qui" alt="Joueur vs joueur">
</MAP>
<IMG SRC="paneline.gif" BORDER=0 usemap="#map_pane_line">
</CENTER>
<UL>
<LI><A NAME="pane_line_info" HREF="#pane_line_info"><B> Totaux des lignes</B></A>:
Indique le nombre de combo de ligne ont &eacute;t&eacute; ex&eacute;cut&eacute; par chaque joueur.
Le total des lignes est aussi indiqu&eacute; dans le bas.

<LI><A NAME="pane_line_qui" HREF="#pane_line_qui"><B> Joueur vs joueur</B></A>:
Cliquez sur le nom d'un joueur pour passer au joueur suivant.
</UL>

<A NAME="pane_chat2" href="#pane_chat2"><center><h2>Multi-joueur: fen&ecirc;tre de dialogue (chat)</h2></center></A>
<p><CENTER>
<MAP name="map_pane_chat">
  <area shape="rect" coords="2,5,212,370" href="#pane_chat_text" alt="Zone de dialogue">
  <area shape="rect" coords="4,381,208,402" href="#pane_chat_input" alt="Zone d'entr&eacute;e">
  <area shape="rect" coords="2,406,175,426" href="#pane_chat_de" alt="De qui">
  <area shape="rect" coords="2,428,156,447" href="#pane_chat_a" alt="A qui">
</MAP>
<IMG SRC="panechat.gif" BORDER=0 usemap="#map_pane_chat">
</CENTER>
<UL>
<LI><A NAME="pane_chat_text" HREF="#pane_chat_text"><B> Zone de dialogue</B></A>:
Affiche le dialogue qui a eu lieu. Les lignes de textes provenant des autres joueurs seront en
fonction de la couleur de leurs &eacute;quipes.

<LI><A NAME="pane_chat_input" HREF="#pane_chat_input"><B> Zone d'entr&eacute;e</B></A>:
Cliquez dans cette zone pour entrer une ligne de texte. Si vous &ecirc;tes en pleine partie, t&acirc;chez
de taper rapidement car vous ne pourrez plus contr&ocirc;ler votre joueur pendant que vous entrez votre message!
<BR><IMG SRC="keyb.gif"> Raccourci au clavier: Appuyez sur RETOUR pour commencer &agrave; taper, puis RETOUR
une deuxi&egrave;me fois pour l'&eacute;mettre. Vous pouvez faire ECHAP pour annuler la ligne de texte en cours.

<LI><A NAME="pane_chat_de" HREF="#pane_chat_de"><B> De qui</B></A>:
Cette zone vous permet de modifier la provenance de vos messages. &Eacute;tant donn&eacute; que vous
pouvez configurer jusqu'&agrave; 3 joueurs par ordinateur, vous pouvez d&eacute;cider de "qui" proviennent
les messages que les autres ordinateurs recevront de vous.

<LI><A NAME="pane_chat_a" HREF="#pane_chat_a"><B> A qui</B></A>:
D&eacute;termine &agrave; qui vous d&eacute;sirez &eacute;mettre vos messages. Vous pouvez choisir TOUS
pour l'envoyer &agrave; tous les autres joueurs, ou choisir une couleur d'&eacute;quipe pour l'envoyer
uniquement &agrave; cette &eacute;quipe.
</UL>

<A NAME="pane_net2" href="#pane_net2"><center><h2>Multi-joueur: les fonctions r&eacute;seau</h2></center></A>
<p><CENTER>
<MAP name="map_pane_net">
  <area shape="rect" coords="8,48,181,70" href="#pane_net_joueur" alt="Ferme joueur">
  <area shape="rect" coords="8,88,185,109" href="#pane_net_conn" alt="Ferme connexion">
  <area shape="rect" coords="10,129,185,167" href="#pane_net_accj" alt="Accepte joueur">
  <area shape="rect" coords="10,169,185,206" href="#pane_net_accc" alt="Accepte connexion">
  <area shape="rect" coords="8,213,182,239" href="#pane_net_ping" alt="Tester Ping">
  <area shape="rect" coords="11,256,185,310" href="#pane_net_maj" alt="M.A.J. des joueurs observ&eacute;s">
  <area shape="rect" coords="7,330,183,354" href="#pane_net_info" alt="Information IP">
</MAP>
<IMG SRC="panenet.gif" BORDER=0 usemap="#map_pane_net">
</CENTER>
<UL>
<LI><A NAME="pane_net_joueur" HREF="#pane_net_joueur"><B> Ferme joueur</B></A>:
Affiche la liste des joueurs pr&eacute;sents dans la partie, et permet de les &eacute;liminer.
<BR><I>Note: ce bouton n'est visible que sur l'ordinateur serveur.</I>

<LI><A NAME="pane_net_conn" HREF="#pane_net_conn"><B> Ferme connexion</B></A>:
Affiche la liste des connexions r&eacute;seaux en cours, et vous permet de les &eacute;liminer.
Si vous fermez une connexion, vous vous trouverez en m&ecirc;me temps &agrave; &eacute;liminer les joueurs
qui &eacute;taient sur cet ordinateur.
<BR><I>Note: ce bouton n'est visible que sur l'ordinateur serveur.</I>

<LI><A NAME="pane_net_accj" HREF="#pane_net_accj"><B> Accepte joueur</B></A>:
Permet d'emp&ecirc;cher les nouveaux joueurs de s'ajouter &agrave; votre partie. Tant que cette option sera
&agrave; "Non", les joueurs qui tenteront de se joindre recevront un message disant "Le serveur a refus&eacute;
votre demande". N&eacute;anmoins, ils pourront dialoguer avec vous gr&acirc;ce &agrave; la fen&ecirc;tre de chat.
<BR><I>Note: cette option n'est visible que sur l'ordinateur serveur.</I>

<LI><A NAME="pane_net_accc" HREF="#pane_net_accc"><B> Accepte connexion</B></A>:
Permet d'emp&ecirc;cher toute tentative de connexion &agrave; votre partie. Utilisez cette fonction pour
assurer votre s&eacute;curit&eacute; au cas o&ugrave; des personnes malfaisantes tenteraient de vous
nuire. Prenez garde toutefois que <B>personne</B> ne pourra se connecter pendant que cette option est
&agrave; "Non".
<BR><I>Note: cette option n'est visible que sur l'ordinateur serveur.</I>

<LI><A NAME="pane_net_ping" HREF="#pane_net_ping"><B> Tester Ping</B></A>:
Cliquez sur ce bouton pour conna&icirc;tre le temps r&eacute;ponse entre votre ordinateur et le serveur.
Si vous avez un temps d&eacute;passant 2000 millisecondes, votre connexion est lente, et tous les
&eacute;v&eacute;nements du jeu risquent d'arriver en retard.
Si vous &ecirc;tes vous-m&ecirc;me le serveur, ce temps devrait &ecirc;tre 10 millisecondes environ.

<LI><A NAME="pane_net_maj" HREF="#pane_net_maj"><B> M.A.J. des joueurs observ&eacute;s</B></A>:
Permet de d&eacute;cider la fr&eacute;quence des mises &agrave; jour visuelles des joueurs observ&eacute;s.
Par exemple, si vous indiquez 10 et que vous observez votre adversaire dans un autre panneau, Quadra
transmettra 10 mises &agrave; jour par seconde afin que vous puissiez suivre ses d&eacute;placements.
Si votre connexion est lente, vous pouvez mettre 0 pour compl&egrave;tement d&eacute;sactiver les mises &agrave;
jour. Vous pourrez tout de m&ecirc;me observer les autres joueurs, cependant, leurs blocs vont sembler
"appara&icirc;tre" directement au lieu de se d&eacute;placer. Si vous &ecirc;tes sur un r&eacute;seau local
&agrave; grande vitesse, vous pouvez tenter de mettre une valeur plus &eacute;lev&eacute;e pour obtenir
des d&eacute;placements beaucoup plus fluides. Prenez notes des points suivants:
<UL>
<LI>Le changement de vitesse de mise &agrave; jour s'effectue en temps r&eacute;el. Cependant, si vous
voulez constater les changements de vitesses demand&eacute;s par les autres joueurs,
vous devrez fermer puis rouvrir ces joueurs si vous les observiez d&eacute;j&agrave;.
<LI>A titre d'indication, sur Internet avec un modem 56.6Kps, vous devriez tenir ce nombre autour de 10 ou
moins. Sur un LAN, autour de 30 devrait &ecirc;tre acceptable et assez fluide. Faites vos exp&eacute;rimentations!
<LI>Il se peut que malgr&eacute; que vous ayez demand&eacute; 50 mises &agrave; jour, un joueur en
particulier semble rester saccad&eacute; ou immobile. La raison est que cet ordinateur a peut-&ecirc;tre
sp&eacute;cifi&eacute; une vitesse de rafra&icirc;chissement d'environ 0, et que Quadra va s'ajuster selon
la vitesse la plus basse des 2 ordinateurs.
<LI>Si vous observez des joueurs en format r&eacute;duit (c'est &agrave; dire plusieurs joueurs dans le m&ecirc;me
panneau), Quadra va automatiquement diminuer de moiti&eacute; la vitesse de rafra&icirc;chissement, &eacute;tant
donn&eacute; la petite dimension des ces canevas.
</UL>

<LI><A NAME="pane_net_info" HREF="#pane_net_info"><B> Information IP</B></A>:
Indique votre adresse IP actuelle.

<A NAME="menu_result" href="#menu_result"><center><h2>Multi-joueur: l'&eacute;cran des r&eacute;sultats</h2></center></A>
<p><CENTER>
<MAP name="map_result">
  <area shape="rect" coords="104,88,424,107" href="#result_titre" alt="Titre des colonnes">
  <area shape="rect" coords="2,113,424,204" href="#result_info" alt="Totaux par joueur">
  <area shape="rect" coords="5,440,191,461" href="#result_fin" alt="Signaler fin de partie">
  <area shape="rect" coords="197,440,326,460" href="#result_change" alt="Changer de page">
  <area shape="rect" coords="339,440,422,462" href="#result_retour" alt="Retour">
  <area shape="rect" coords="429,45,634,477" href="#result_chat" alt="Zone de dialogue (chat)">
</MAP>
<IMG SRC="result.jpg" BORDER=0 usemap="#map_result" HEIGHT=480 WIDTH=640>
</CENTER>
<UL>
<LI><A NAME="result_titre" href="#result_titre"><B> Titre des colonnes</B></A>:
Cliquez sur le titre d'une colonne pour s&eacute;lectionner l'ordre de tri des joueurs.

<LI><A NAME="result_info" href="#result_info"><B> Totaux par joueur</B></A>:
Cette r&eacute;gion indique les divers totaux par joueurs avec des totaux cumulatifs par &eacute;quipe.

<LI><A NAME="result_fin" href="#result_fin"><B> Signaler fin de partie</B></A>:
Ce bouton sert &agrave; signaler la fin de la partie &agrave; tous les joueurs actifs pr&eacute;sentement.
Une fois la fin signal&eacute;e, personne ne pourra se joindre &agrave; cette partie, car elle sera consid&eacute;r&eacute;e
comme termin&eacute;e. Si, lors de la cr&eacute;ation de cette partie, vous aviez choisi qu'elle se termine
au bout de <I>X</I> minutes ou lorsqu'une &eacute;quipe atteint <I>X</I> frags, vous pouvez d&eacute;cider
de mettre fin avant l'&eacute;ch&eacute;ance. Par ailleurs, ce bouton dispara&icirc;tra si la partie est
d&eacute;j&agrave; termin&eacute;e.
<BR><I>Note: ce bouton n'est visible que sur l'ordinateur serveur ET en mode multi-joueur TCP/IP</I>

<LI><A NAME="result_change" href="#result_change"><B> Changer de page</B></A>:
Cliquez ici pour changer de page de statistiques.

<LI><A NAME="result_retour" href="#menu_create"><IMG SRC="go_eng.gif" border=0><B> Retour</B></A>:
Ce bouton vous retourne au menu pr&eacute;c&eacute;dent et vous d&eacute;connecte de la partie. Si vous
&eacute;tiez le serveur, ceci &agrave; pour effet d'&eacute;mettre un message "Le serveur a &eacute;t&eacute;
d&eacute;connect&eacute;" aux autres ordinateurs, et cela interrompt leurs parties s'ils &eacute;taient
encore actifs.
<BR><I>Note: Les autres joueurs ne pourront plus dialoguer entre eux si vous sortez de l'&eacute;cran des
r&eacute;sultats, car tous les messages doivent absolument passer par le serveur.</I>

<LI><A NAME="result_chat" href="#result_chat"><B> Zone de dialogue (chat)</B></A>:
Cette zone est exactement identique au panneau "fen&ecirc;tre de chat" de l'&eacute;cran de jeu. Vous
pouvez ainsi continuer &agrave; dialoguer avec les autres joueurs malgr&eacute; que la partie soit termin&eacute;e.
<BR><I>Note: ce panneau n'est visible qu'en mode multi-joueur TCP/IP (LAN ou Internet)</I>
</UL>

<A NAME="menu_demo" href="#menu_demo"><center><h2>La centrale de d&eacute;mo</h2></center></A>
<p><CENTER>
<MAP name="map_demo">
<area shape="rect" coords="11,50,628,69" href="#demo_rep" alt="R&eacute;pertoire en cours">
<area shape="rect" coords="210,90,638,323" href="#demo_info" alt="Information">
<area shape="rect" coords="9,92,190,389" href="#demo_list" alt="Liste des fichiers">
<area shape="rect" coords="27,399,175,420" href="#demo_vision" alt="Visionner d&eacute;mo">
<area shape="rect" coords="557,430,639,448" href="#demo_retour" alt="Retour">
</MAP>
<IMG SRC="demo.jpg" BORDER=0 usemap="#map_demo" HEIGHT=480 WIDTH=640>
</CENTER>
<UL>
<LI><A NAME="demo_rep" href="#demo_rep"><B> R&eacute;pertoire en cours</B></A>:
Vous pouvez taper un r&eacute;pertoire diff&eacute;rent de celui propos&eacute; par d&eacute;faut (qui se
trouve &agrave; &ecirc;tre le r&eacute;pertoire o&ugrave; est install&eacute; Quadra).

<LI><A NAME="demo_info" href="#demo_info"><B> Information</B></A>: Cette zone indique les renseignements
sur la partie s&eacute;lectionn&eacute;e dans la liste de gauche, ainsi que la liste des joueurs et leurs
statistiques lors de la fin de partie.

<LI><A NAME="demo_list" href="#demo_list"><B> Liste des fichiers</B></A>: Cette liste affiche tous les
fichiers <B>*.REC</B> trouv&eacute;s dans le r&eacute;pertoire en cours. Cliquez sur un fichier pour le
s&eacute;lectionner, ou double-cliquez pour passez directement au visionnement.<BR>
<I>Note: vous remarquerez que les fichiers de d&eacute;mo appel&eacute;s <B>GLOBALx.REC</B> et <B>LOCALx.REC</B>
correspondent aux d&eacute;mos des meilleurs pointages mondiaux et locaux.</I>

<LI><A NAME="demo_vision" href="#demo_vision"><B> Visionner d&eacute;mo</B></A>: Ce bouton vous
transporte dans l'&eacute;cran de jeu afin de regarder se d&eacute;rouler la partie que vous avez
choisie. Des boutons de contr&ocirc;le <I>Vitesse lente</I> et <I>Vitesse rapide</I> seront disponible
lors du d&eacute;roulement de la partie.

<LI><A NAME="demo_retour" href="#menu_principal"><IMG SRC="go_eng.gif" border=0><B> Retour</B></A>:
Retourne au menu principal.
</UL>

<BR><CENTER><ADDRESS>
<FONT SIZE=-1><A HREF="mailto:support@ludusdesign.com">support@ludusdesign.com</A></FONT></ADDRESS></CENTER>
<CENTER><FONT SIZE=-1>&copy;1999 Ludus Design. Tous droits r&eacute;serv&eacute;s.</FONT></CENTER>
<CENTER><FONT SIZE=-1>Derni&egrave;re mise &agrave; jour: 1999-08-23</FONT></CENTER>
</TD>
</TR>
</TABLE>
</BODY>
</HTML>
